#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
Acquiring state lock. This may take a few moments...
azurerm_resource_group.rg: Refreshing state... [id=/subscriptions/16e01a00-f825-4c96-8ae2-e68cb52cf653/resourceGroups/rg-noplan-dev-001]
data.azurerm_client_config.current: Reading...
data.azurerm_client_config.current: Read complete after 0s [id=2022-08-19 03:40:36.361219123 +0000 UTC]
azurerm_user_assigned_identity.id: Refreshing state... [id=/subscriptions/16e01a00-f825-4c96-8ae2-e68cb52cf653/resourceGroups/rg-noplan-dev-001/providers/Microsoft.ManagedIdentity/userAssignedIdentities/id-noplan-dev-westeurope-001]
azurerm_mssql_server.sql-server: Refreshing state... [id=/subscriptions/16e01a00-f825-4c96-8ae2-e68cb52cf653/resourceGroups/rg-noplan-dev-001/providers/Microsoft.Sql/servers/sql-noplan-dev-001]
azurerm_key_vault.vault: Refreshing state... [id=/subscriptions/16e01a00-f825-4c96-8ae2-e68cb52cf653/resourceGroups/rg-noplan-dev-001/providers/Microsoft.KeyVault/vaults/kv-noplan-dev-001]
azurerm_container_registry.acr: Refreshing state... [id=/subscriptions/16e01a00-f825-4c96-8ae2-e68cb52cf653/resourceGroups/rg-noplan-dev-001/providers/Microsoft.ContainerRegistry/registries/crnoplandev001]
azurerm_log_analytics_workspace.appinsights-workspace: Refreshing state... [id=/subscriptions/16e01a00-f825-4c96-8ae2-e68cb52cf653/resourceGroups/rg-noplan-dev-001/providers/Microsoft.OperationalInsights/workspaces/log-noplan-dev-001]
azurerm_app_configuration.app-config: Refreshing state... [id=/subscriptions/16e01a00-f825-4c96-8ae2-e68cb52cf653/resourceGroups/rg-noplan-dev-001/providers/Microsoft.AppConfiguration/configurationStores/appcs-noplan-dev]
azurerm_role_assignment.uami-secrets-user-role: Refreshing state... [id=/subscriptions/16e01a00-f825-4c96-8ae2-e68cb52cf653/resourceGroups/rg-noplan-dev-001/providers/Microsoft.KeyVault/vaults/kv-noplan-dev-001/providers/Microsoft.Authorization/roleAssignments/c23c1c35-f6ce-44e5-b6f9-d4d16c6ab599]
azurerm_role_assignment.dev-group-secrets-administrator-role: Refreshing state... [id=/subscriptions/16e01a00-f825-4c96-8ae2-e68cb52cf653/resourceGroups/rg-noplan-dev-001/providers/Microsoft.KeyVault/vaults/kv-noplan-dev-001/providers/Microsoft.Authorization/roleAssignments/df50f6dc-6bdd-45c8-9fc6-c23156c8dfd4]
azurerm_role_assignment.uami-acrpull-role: Refreshing state... [id=/subscriptions/16e01a00-f825-4c96-8ae2-e68cb52cf653/resourceGroups/rg-noplan-dev-001/providers/Microsoft.ContainerRegistry/registries/crnoplandev001/providers/Microsoft.Authorization/roleAssignments/ebb66f86-96b7-96ad-02e7-8a122d7026fb]
azurerm_role_assignment.github-actions-acrpush-role: Refreshing state... [id=/subscriptions/16e01a00-f825-4c96-8ae2-e68cb52cf653/resourceGroups/rg-noplan-dev-001/providers/Microsoft.ContainerRegistry/registries/crnoplandev001/providers/Microsoft.Authorization/roleAssignments/a4684096-994c-419f-a88e-481ca3463651]
azurerm_mssql_database.noplan: Refreshing state... [id=/subscriptions/16e01a00-f825-4c96-8ae2-e68cb52cf653/resourceGroups/rg-noplan-dev-001/providers/Microsoft.Sql/servers/sql-noplan-dev-001/databases/noplan]
azurerm_application_insights.appinsights: Refreshing state... [id=/subscriptions/16e01a00-f825-4c96-8ae2-e68cb52cf653/resourceGroups/rg-noplan-dev-001/providers/Microsoft.Insights/components/appi-noplan-dev-001]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # azurerm_app_configuration.app-config will be updated in-place
  ~ resource "azurerm_app_configuration" "app-config" {
        id                  = "/subscriptions/16e01a00-f825-4c96-8ae2-e68cb52cf653/resourceGroups/rg-noplan-dev-001/providers/Microsoft.AppConfiguration/configurationStores/appcs-noplan-dev"
        name                = "appcs-noplan-dev"
      ~ tags                = {
          ~ "managed-by"  = "Pulumi" -> "Terraform"
            # (2 unchanged elements hidden)
        }
        # (8 unchanged attributes hidden)

      + identity {
          + identity_ids = [
              + "/subscriptions/16e01a00-f825-4c96-8ae2-e68cb52cf653/resourceGroups/rg-noplan-dev-001/providers/Microsoft.ManagedIdentity/userAssignedIdentities/id-noplan-dev-westeurope-001",
            ]
          + type         = "UserAssigned"
        }

        # (1 unchanged block hidden)
    }

  # azurerm_application_insights.appinsights must be replaced
-/+ resource "azurerm_application_insights" "appinsights" {
      ~ app_id                                = "c3e2406d-514a-4d1a-9209-3a1a658edac2" -> (known after apply)
      ~ connection_string                     = (sensitive value)
      ~ daily_data_cap_in_gb                  = 100 -> (known after apply)
      ~ daily_data_cap_notifications_disabled = false -> (known after apply)
      ~ id                                    = "/subscriptions/16e01a00-f825-4c96-8ae2-e68cb52cf653/resourceGroups/rg-noplan-dev-001/providers/Microsoft.Insights/components/appi-noplan-dev-001" -> (known after apply)
      ~ instrumentation_key                   = (sensitive value)
        name                                  = "appi-noplan-dev-001"
      ~ tags                                  = {
          ~ "managed-by"  = "Pulumi" -> "Terraform"
            # (2 unchanged elements hidden)
        }
      ~ workspace_id                          = "/subscriptions/16e01a00-f825-4c96-8ae2-e68cb52cf653/resourcegroups/rg-noplan-dev-001/providers/microsoft.operationalinsights/workspaces/log-noplan-dev-001" -> "/subscriptions/16e01a00-f825-4c96-8ae2-e68cb52cf653/resourceGroups/rg-noplan-dev-001/providers/Microsoft.OperationalInsights/workspaces/log-noplan-dev-001" # forces replacement
        # (10 unchanged attributes hidden)
    }

  # azurerm_container_registry.acr will be updated in-place
  ~ resource "azurerm_container_registry" "acr" {
        id                            = "/subscriptions/16e01a00-f825-4c96-8ae2-e68cb52cf653/resourceGroups/rg-noplan-dev-001/providers/Microsoft.ContainerRegistry/registries/crnoplandev001"
        name                          = "crnoplandev001"
      ~ tags                          = {
          ~ "managed-by"  = "Pulumi" -> "Terraform"
            # (2 unchanged elements hidden)
        }
        # (16 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # azurerm_key_vault.vault will be updated in-place
  ~ resource "azurerm_key_vault" "vault" {
        id                              = "/subscriptions/16e01a00-f825-4c96-8ae2-e68cb52cf653/resourceGroups/rg-noplan-dev-001/providers/Microsoft.KeyVault/vaults/kv-noplan-dev-001"
        name                            = "kv-noplan-dev-001"
      ~ tags                            = {
          ~ "managed-by"  = "Pulumi" -> "Terraform"
            # (2 unchanged elements hidden)
        }
        # (13 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # azurerm_log_analytics_workspace.appinsights-workspace will be updated in-place
  ~ resource "azurerm_log_analytics_workspace" "appinsights-workspace" {
        id                         = "/subscriptions/16e01a00-f825-4c96-8ae2-e68cb52cf653/resourceGroups/rg-noplan-dev-001/providers/Microsoft.OperationalInsights/workspaces/log-noplan-dev-001"
        name                       = "log-noplan-dev-001"
      ~ tags                       = {
          ~ "managed-by"  = "Pulumi" -> "Terraform"
            # (2 unchanged elements hidden)
        }
        # (11 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # azurerm_mssql_database.noplan will be updated in-place
  ~ resource "azurerm_mssql_database" "noplan" {
        id                                  = "/subscriptions/16e01a00-f825-4c96-8ae2-e68cb52cf653/resourceGroups/rg-noplan-dev-001/providers/Microsoft.Sql/servers/sql-noplan-dev-001/databases/noplan"
        name                                = "noplan"
      ~ tags                                = {
          ~ "managed-by"  = "Pulumi" -> "Terraform"
            # (2 unchanged elements hidden)
        }
        # (14 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # azurerm_mssql_server.sql-server will be updated in-place
  ~ resource "azurerm_mssql_server" "sql-server" {
        id                                   = "/subscriptions/16e01a00-f825-4c96-8ae2-e68cb52cf653/resourceGroups/rg-noplan-dev-001/providers/Microsoft.Sql/servers/sql-noplan-dev-001"
        name                                 = "sql-noplan-dev-001"
      ~ tags                                 = {
          ~ "managed-by"  = "Pulumi" -> "Terraform"
            # (2 unchanged elements hidden)
        }
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # azurerm_resource_group.rg will be updated in-place
  ~ resource "azurerm_resource_group" "rg" {
        id       = "/subscriptions/16e01a00-f825-4c96-8ae2-e68cb52cf653/resourceGroups/rg-noplan-dev-001"
        name     = "rg-noplan-dev-001"
      ~ tags     = {
          ~ "managed-by"  = "Pulumi" -> "Terraform"
            # (2 unchanged elements hidden)
        }
        # (1 unchanged attribute hidden)

        # (1 unchanged block hidden)
    }

  # azurerm_user_assigned_identity.id will be updated in-place
  ~ resource "azurerm_user_assigned_identity" "id" {
        id                  = "/subscriptions/16e01a00-f825-4c96-8ae2-e68cb52cf653/resourceGroups/rg-noplan-dev-001/providers/Microsoft.ManagedIdentity/userAssignedIdentities/id-noplan-dev-westeurope-001"
        name                = "id-noplan-dev-westeurope-001"
      ~ tags                = {
          ~ "managed-by"  = "Pulumi" -> "Terraform"
            # (2 unchanged elements hidden)
        }
        # (5 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Plan: 1 to add, 8 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>

      *Pushed by: @dependabot[bot], Action: `pull_request`*